import jieba

banlist = [' ', '：', '“', '”', '的', '，', '将', '谈', '在', '为', ':', '...', '【', '】', '"', '（', '）', '中', '！',
           '之', '—', '与', '《', '》', '向', '？', '要', '后', '是', '你', '?', '有', '什么', '让', '·', '…', '(', ')' ,
           '', '了', '和', '也', '对', '这', '年', '等', '\r\n', '年', '月', '日', '。', '　', '、', '０', '２', 'Ｇ', '1',
           '2', '3', '4', '5', '6', '7', '8', '9', '0', '%', '！', '」', '「', '／', '〔', '〕', '摄', '；', '▲', '影']

replace_list = {'國瑜': '韓國瑜', '韓總': '韓國瑜', '韓導': '韓國瑜', '韓流': '韓國瑜', '韓風': '韓國瑜', '其邁': '陳其邁',
                '藍營': '國名黨', '館長': '陳之漢', '柱柱姐': '洪秀柱', '花媽': '陳菊', '綠營': '民進黨', '丁丁': '丁守中', '丁爺爺': '丁守中',
                '阿伯': '柯文哲', '柯P': '柯文哲', '柯': '柯文哲', 'P': '柯文哲', 'p': '柯文哲', 'KP': '柯文哲', '阿北': '柯文哲',
                '蘇': '蘇貞昌', '電火球': '蘇貞昌', '萼': '吳萼洋', '洋': '吳萼洋', '侯': '侯友宜', '賴神': '賴清德', '段': '段宜康',
                '世堅情': '王世堅', '戰神': '黃國昌', '黃老師': '黃國昌', '宜康': '段宜康', '姚姚': '姚文智', '小英': '蔡英文'}

supplement_people = ['柯文哲', '丁守中', '苏贞昌', '侯友宜', '陈其迈', '韩国瑜', '林佳龙', '姚文智', '卢秀燕', '鄭文燦', '黄伟哲',
                     '魏明谷', '林右昌', '李进勇', '高思博', '涂醒哲', '林明湊', '张丽善', '林智坚', '陈学聖', '徐耀昌', '潘孟安',
                     '林为洲', '謝立功', '黃敏惠', '陳歐珀', '徐榛蔚', '翁章梁', '王惠美', '饒慶鈴', '陳福海', '林姿妙', '楊鎮浯',
                     '徐定禎', '洪國浩', '許明財', '林義豐', '吳育仁', '劉櫂豪', '陳光復', '蘇清泉', '劉增應', '賴峰偉', '鄭伊廷',
                     '朱立伦', '吴钊燮', '徐世勳', '罗智强', '吴敦义', '蔡英文', '马英九']

supplement_terms = ['民调', '深澳电厂', '两岸', '我国', '五星旗', '五星红旗']
#  添加词典

for i in replace_list:
    jieba.add_word(i)
for i in supplement_people:
    jieba.add_word(i)
for i in supplement_terms:
    jieba.add_word(i)

